package zadachi;

public class Task7 {
    //Задача 7
    //Напечатать "столбиком":
    //все целые числа от 20 до 35;
    public static void main(String[] args) {
        for (int i = 20; i <=35 ; i++) {
            System.out.println(i);

        }
    }
}
